hw06-performance-postgresql/ansible/results/pgbench-tuned_safe_8cpu_32gb.txt
pgbench (17.9 (Ubuntu 17.9-1.pgdg24.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 100
query mode: prepared
number of clients: 20
number of threads: 4
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 694056
number of failed transactions: 0 (0.000%)
latency average = 1.729 ms
initial connection time = 19.324 ms
tps = 11569.005249 (without initial connection time)
starting vacuum...end.