hw06-performance-postgresql/ansible/results/pgbench-tuned_safe_hdd_8cpu_32gb.txt
pgbench (17.9 (Ubuntu 17.9-1.pgdg24.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 100
query mode: prepared
number of clients: 20
number of threads: 4
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 750398
number of failed transactions: 0 (0.000%)
latency average = 1.599 ms
initial connection time = 17.524 ms
tps = 12508.761074 (without initial connection time)
starting vacuum...end.