hw06-performance-postgresql/ansible/results/pgbench-tuned_safe_heavy.txt
pgbench (17.9 (Ubuntu 17.9-1.pgdg24.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 100
query mode: prepared
number of clients: 64
number of threads: 8
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 787286
number of failed transactions: 0 (0.000%)
latency average = 4.876 ms
initial connection time = 51.368 ms
tps = 13126.701954 (without initial connection time)
starting vacuum...end.